balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA306.PIC
<?xml version="1.0" encoding="UTF-8" standalone="no" ?><edc:PIC xmlns:edc="http://crownking/edc" edc:arch="24xxxx" edc:desc="" edc:informedby="DOS" edc:isextended="false" edc:name="PIC24FJ64GA306" edc:procid="0x16e" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Power>
    <edc:VPP edc:defaultvoltage="3.250" edc:maxvoltage="3.500" edc:minvoltage="2.000"/>
    <edc:VDD edc:maxdefaultvoltage="3.500" edc:maxvoltage="3.500" edc:mindefaultvoltage="2.000" edc:minvoltage="2.000" edc:nominalvoltage="3.250"/>
  </edc:Power>
  <edc:Programming edc:memtech="ee" edc:tries="1">
    <edc:Wait edc:cfg="10000" edc:eedata="10000" edc:erase="600" edc:pgm="10000" edc:userid="10000"/>
    <edc:Latches edc:cfg="2" edc:eedata="2" edc:pgm="128" edc:rowerase="170"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="24xxxx" edc:name="24xxxx">
    <edc:MemTraits edc:extendeddataspace="PIC24FP">
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xff7fff" edc:wordsize="0x4"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:UserIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ConfigFuseMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:DeviceIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x0"/>
      <edc:DataMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0x0" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:InterruptList>
    <edc:Trap edc:cname="ReservedTrap0" edc:desc="Reserved"/>
    <edc:Trap edc:cname="OscillatorFail" edc:desc="Oscillator Fail Trap vector"/>
    <edc:Trap edc:cname="AddressError" edc:desc="Address Error Trap Vector"/>
    <edc:Trap edc:cname="StackError" edc:desc="Stack Error Trap Vector"/>
    <edc:Trap edc:cname="MathError" edc:desc="Math Error Trap Vector"/>
    <edc:Trap edc:cname="ReservedTrap5" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap6" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap7" edc:desc="Reserved"/>
    <edc:Interrupt edc:cname="INT0Interrupt" edc:desc="INT0 - External Interrupt 0" edc:irq="0"/>
    <edc:Interrupt edc:cname="IC1Interrupt" edc:desc="IC1 - Input Capture 1" edc:irq="1"/>
    <edc:Interrupt edc:cname="OC1Interrupt" edc:desc="OC1 - Output Compare 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="T1Interrupt" edc:desc="T1 - Timer1" edc:irq="3"/>
    <edc:Interrupt edc:cname="DMA0Interrupt" edc:desc="DMA0 - Direct Memory Access0" edc:irq="4"/>
    <edc:Interrupt edc:cname="IC2Interrupt" edc:desc="IC2 - Input Capture 2" edc:irq="5"/>
    <edc:Interrupt edc:cname="OC2Interrupt" edc:desc="OC2 - Output Compare 2" edc:irq="6"/>
    <edc:Interrupt edc:cname="T2Interrupt" edc:desc="T2 - Timer2" edc:irq="7"/>
    <edc:Interrupt edc:cname="T3Interrupt" edc:desc="T3 - Timer3" edc:irq="8"/>
    <edc:Interrupt edc:cname="SPI1ErrInterrupt" edc:desc="SPI1E - SPI1 Error" edc:irq="9"/>
    <edc:Interrupt edc:cname="SPI1Interrupt" edc:desc="SPI1 - SPI1 Transfer Done" edc:irq="10"/>
    <edc:Interrupt edc:cname="U1RXInterrupt" edc:desc="U1RX - UART1 Receiver" edc:irq="11"/>
    <edc:Interrupt edc:cname="U1TXInterrupt" edc:desc="U1TX - UART1 Transmitter" edc:irq="12"/>
    <edc:Interrupt edc:cname="ADC1Interrupt" edc:desc="ADC1 - A/D Converter 1" edc:irq="13"/>
    <edc:Interrupt edc:cname="DMA1Interrupt" edc:desc="DMA1 - Direct Memory Access1" edc:irq="14"/>
    <edc:Interrupt edc:cname="SI2C1Interrupt" edc:desc="SI2C1 - I2C1 Slave Events" edc:irq="16"/>
    <edc:Interrupt edc:cname="MI2C1Interrupt" edc:desc="MI2C1 - I2C1 Master Events" edc:irq="17"/>
    <edc:Interrupt edc:cname="CompInterrupt" edc:desc="Comp - Comparator" edc:irq="18"/>
    <edc:Interrupt edc:cname="CNInterrupt" edc:desc="CN -  Change Notification Interrupt" edc:irq="19"/>
    <edc:Interrupt edc:cname="INT1Interrupt" edc:desc="INT1 - External Interrupt 1" edc:irq="20"/>
    <edc:Interrupt edc:cname="IC7Interrupt" edc:desc="IC7 - Input Capture 7" edc:irq="22"/>
    <edc:Interrupt edc:cname="DMA2Interrupt" edc:desc="DMA2 - Direct Memory Access2" edc:irq="24"/>
    <edc:Interrupt edc:cname="OC3Interrupt" edc:desc="OC3 - Output Compare 3" edc:irq="25"/>
    <edc:Interrupt edc:cname="OC4Interrupt" edc:desc="OC4 - Output Compare 4" edc:irq="26"/>
    <edc:Interrupt edc:cname="T4Interrupt" edc:desc="T4 - Timer4" edc:irq="27"/>
    <edc:Interrupt edc:cname="T5Interrupt" edc:desc="T5 - Timer5" edc:irq="28"/>
    <edc:Interrupt edc:cname="INT2Interrupt" edc:desc="INT2 - External Interrupt 2" edc:irq="29"/>
    <edc:Interrupt edc:cname="U2RXInterrupt" edc:desc="U2RX - UART2 Receiver" edc:irq="30"/>
    <edc:Interrupt edc:cname="U2TXInterrupt" edc:desc="U2TX - UART2 Transmitter" edc:irq="31"/>
    <edc:Interrupt edc:cname="SPI2ErrInterrupt" edc:desc="SPI2E - SPI2 Error" edc:irq="32"/>
    <edc:Interrupt edc:cname="SPI2Interrupt" edc:desc="SPI2 - SPI2 Transfer Done" edc:irq="33"/>
    <edc:Interrupt edc:cname="DMA3Interrupt" edc:desc="DMA3 - Direct Memory Access3" edc:irq="36"/>
    <edc:Interrupt edc:cname="IC3Interrupt" edc:desc="IC3 - Input Capture 3" edc:irq="37"/>
    <edc:Interrupt edc:cname="IC4Interrupt" edc:desc="IC4 - Input Capture 4" edc:irq="38"/>
    <edc:Interrupt edc:cname="IC5Interrupt" edc:desc="IC5 - Input Capture 5" edc:irq="39"/>
    <edc:Interrupt edc:cname="IC6Interrupt" edc:desc="IC6 - Input Capture 6" edc:irq="40"/>
    <edc:Interrupt edc:cname="OC5Interrupt" edc:desc="OC5 - Output Compare 5" edc:irq="41"/>
    <edc:Interrupt edc:cname="OC6Interrupt" edc:desc="OC6 - Output Compare 6" edc:irq="42"/>
    <edc:Interrupt edc:cname="OC7Interrupt" edc:desc="OC7 - Output Compare 7" edc:irq="43"/>
    <edc:Interrupt edc:cname="PMPInterrupt" edc:desc="PMP - Parallel Master Port" edc:irq="45"/>
    <edc:Interrupt edc:cname="DMA4Interrupt" edc:desc="DMA4 - Direct Memory Access4" edc:irq="46"/>
    <edc:Interrupt edc:cname="SI2C2Interrupt" edc:desc="SI2C2 - I2C2 Slave Events" edc:irq="49"/>
    <edc:Interrupt edc:cname="MI2C2Interrupt" edc:desc="MI2C2 - I2C2 Master Events" edc:irq="50"/>
    <edc:Interrupt edc:cname="INT3Interrupt" edc:desc="INT3 - External Interrupt 3" edc:irq="53"/>
    <edc:Interrupt edc:cname="INT4Interrupt" edc:desc="INT4 - External Interrupt 4" edc:irq="54"/>
    <edc:Interrupt edc:cname="DMA5Interrupt" edc:desc="DMA5 - Direct Memory Access5" edc:irq="61"/>
    <edc:Interrupt edc:cname="RTCCInterrupt" edc:desc="RTCC - Real-Time Clock and Calendar" edc:irq="62"/>
    <edc:Interrupt edc:cname="U1ErrInterrupt" edc:desc="U1E - UART1 Error" edc:irq="65"/>
    <edc:Interrupt edc:cname="U2ErrInterrupt" edc:desc="U2E - UART2 Error" edc:irq="66"/>
    <edc:Interrupt edc:cname="CRCInterrupt" edc:desc="CRC - Cyclic Redunancy Check" edc:irq="67"/>
    <edc:Interrupt edc:cname="LVDInterrupt" edc:desc="LVD - Low Voltage Detect" edc:irq="72"/>
    <edc:Interrupt edc:cname="CTMUInterrupt" edc:desc="CTMU - Interrupt" edc:irq="77"/>
    <edc:Interrupt edc:cname="U3ErrInterrupt" edc:desc="U3E - UART3 Error" edc:irq="81"/>
    <edc:Interrupt edc:cname="U3RXInterrupt" edc:desc="U3RX - UART3 Receiver" edc:irq="82"/>
    <edc:Interrupt edc:cname="U3TXInterrupt" edc:desc="U3TX - UART3 Transmitter" edc:irq="83"/>
    <edc:Interrupt edc:cname="U4ErrInterrupt" edc:desc="U4E - UART4 Error" edc:irq="87"/>
    <edc:Interrupt edc:cname="U4RXInterrupt" edc:desc="U4RX - UART4 Receiver" edc:irq="88"/>
    <edc:Interrupt edc:cname="U4TXInterrupt" edc:desc="U4TX - UART4 Transmitter" edc:irq="89"/>
    <edc:Interrupt edc:cname="LCDInterrupt" edc:desc="LCD - LCD " edc:irq="100"/>
    <edc:Interrupt edc:cname="JTAGInterrupt" edc:desc="JTAG - JTAG " edc:irq="117"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasdatacapture="true" edc:hwbpcount="0x5" edc:idbyte="x"/>
  <edc:ProgramSpace>
    <edc:ResetSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="reset"/>
    <edc:VectorSector edc:beginaddr="0x04" edc:endaddr="0x100" edc:regionid="ivt"/>
    <edc:CodeSector edc:beginaddr="0x100" edc:endaddr="0x104" edc:isreserved="true" edc:regionid="_reserved"/>
    <edc:AltVectorSector edc:beginaddr="0x104" edc:endaddr="0x200" edc:regionid="aivt"/>
    <edc:CodeSector edc:beginaddr="0x200" edc:endaddr="0xABF8" edc:regionid="program"/>
    <edc:WORMHoleSector edc:beginaddr="0xABF8" edc:endaddr="0xAC00" edc:regionid="cfgmem">
      <edc:WORMHole edc:dstaddr="0xf80004" edc:dstmask="0x01" edc:srcaddr="0xabfe" edc:srcmask="0x1000"/>
      <edc:WORMHole edc:dstaddr="0xf80004" edc:dstmask="0x02" edc:srcaddr="0xabfe" edc:srcmask="0x2000"/>
      <edc:WORMHole edc:dstaddr="0xf80004" edc:dstmask="0xFC" edc:srcaddr="0xabfa" edc:srcmask="0x007f"/>
      <edc:WORMHole edc:dstaddr="0xf80006" edc:dstmask="0x07" edc:srcaddr="0xabfc" edc:srcmask="0x0700"/>
      <edc:WORMHole edc:dstaddr="0xf80006" edc:dstmask="0x80" edc:srcaddr="0xabfc" edc:srcmask="0x8000"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0x03" edc:srcaddr="0xabfc" edc:srcmask="0x0003"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0x04" edc:srcaddr="0xabfc" edc:srcmask="0x0020"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0x18" edc:srcaddr="0xabfa" edc:srcmask="0x0300"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0x20" edc:srcaddr="0xabfc" edc:srcmask="0x0010"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0xc0" edc:srcaddr="0xabfc" edc:srcmask="0x00c0"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x0f" edc:srcaddr="0xabfe" edc:srcmask="0x000f"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x10" edc:srcaddr="0xabfe" edc:srcmask="0x0010"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x20" edc:srcaddr="0xabfe" edc:srcmask="0x0080"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x40" edc:srcaddr="0xabfe" edc:srcmask="0x0040"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x80" edc:srcaddr="0xabfc" edc:srcmask="0x1000"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x01" edc:srcaddr="0xabfa" edc:srcmask="0x1000"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x0a" edc:srcaddr="0xabfa" edc:srcmask="0x0c00"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x04" edc:srcaddr="0xabfe" edc:srcmask="0x0400"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x10" edc:srcaddr="0xabfe" edc:srcmask="0x0020"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x20" edc:srcaddr="0xabfc" edc:srcmask="0x0008"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x40" edc:srcaddr="0xabfc" edc:srcmask="0x0800"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x80" edc:srcaddr="0xabf8" edc:srcmask="0x0400"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x03" edc:srcaddr="0xabfe" edc:srcmask="0x0300"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x10" edc:srcaddr="0xabfe" edc:srcmask="0x8000"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x20" edc:srcaddr="0xabfe" edc:srcmask="0x4000"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x80" edc:srcaddr="0xabfe" edc:srcmask="0x0800"/>
      <edc:WORMHole edc:dstaddr="0xf80010" edc:dstmask="0x1F" edc:srcaddr="0xabf8" edc:srcmask="0x001f"/>
      <edc:WORMHole edc:dstaddr="0xf80010" edc:dstmask="0x20" edc:srcaddr="0xabf8" edc:srcmask="0x0020"/>
      <edc:WORMHole edc:dstaddr="0xf80010" edc:dstmask="0x40" edc:srcaddr="0xabf8" edc:srcmask="0x0040"/>
      <edc:WORMHole edc:dstaddr="0xf80010" edc:dstmask="0x80" edc:srcaddr="0xabf8" edc:srcmask="0x0080"/>
      <edc:WORMHole edc:dstaddr="0xf80012" edc:dstmask="0x01" edc:srcaddr="0xabfa" edc:srcmask="0x8000"/>
      <edc:WORMHole edc:dstaddr="0xf80012" edc:dstmask="0x02" edc:srcaddr="0xabfa" edc:srcmask="0x4000"/>
      <edc:WORMHole edc:dstaddr="0xf80012" edc:dstmask="0x04" edc:srcaddr="0xabfa" edc:srcmask="0x2000"/>
      <edc:WORMHole edc:dstaddr="0xf80012" edc:dstmask="0x08" edc:srcaddr="0xabfc" edc:srcmask="0x0004"/>
      <edc:WORMHole edc:dstaddr="0xf80012" edc:dstmask="0x10" edc:srcaddr="0xabf8" edc:srcmask="0x0100"/>
      <edc:WORMHole edc:dstaddr="0xf80012" edc:dstmask="0x20" edc:srcaddr="0xabf8" edc:srcmask="0x0200"/>
      <edc:WORMHole edc:dstaddr="0xf80012" edc:dstmask="0x40" edc:srcaddr="0xabfa" edc:srcmask="0x0040"/>
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CONFIG4" edc:default="0xffff" edc:desc="" edc:impl="0xffff" edc:name="CONFIG4" edc:nzwidth="16" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="DSWDTPS" edc:desc="Deep Sleep Watchdog Timer Postscale Select bits" edc:mask="0x1f" edc:name="DSWDTPS" edc:nzwidth="5">
              <edc:DCRFieldSemantic edc:cname="DSWDTPS1F" edc:desc="1:68719476736 (25.7 Days)" edc:when="(field &amp; 0x1f) == 0x1f"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS1E" edc:desc="1:34359738368 (12.8  Days)" edc:when="(field &amp; 0x1f) == 0x1e"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS1D" edc:desc="1:17179869184 (6.4 Days)" edc:when="(field &amp; 0x1f) == 0x1d"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS1C" edc:desc="1:8589934592 (77 Hours)" edc:when="(field &amp; 0x1f) == 0x1c"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS1B" edc:desc="1:4294967296 (38.5 Hours)" edc:when="(field &amp; 0x1f) == 0x1b"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS1A" edc:desc="1:2147483648 (19.2 Hours)" edc:when="(field &amp; 0x1f) == 0x1a"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS19" edc:desc="1:1073741824 (9.6 Hours)" edc:when="(field &amp; 0x1f) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS18" edc:desc="1:536870912 (4.8 Hours)" edc:when="(field &amp; 0x1f) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS17" edc:desc="1:268435456 (2.4 Hours)" edc:when="(field &amp; 0x1f) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS16" edc:desc="1:134217728 (72.2 Minutes)" edc:when="(field &amp; 0x1f) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS15" edc:desc="1:67108864 (36.1 Minutes)" edc:when="(field &amp; 0x1f) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS14" edc:desc="1:33554432 (18 Minutes)" edc:when="(field &amp; 0x1f) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS13" edc:desc="1:16777216 (9 Minutes)" edc:when="(field &amp; 0x1f) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS12" edc:desc="1:8388608 (4.5 Minutes)" edc:when="(field &amp; 0x1f) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS11" edc:desc="1:4194304 (135.3 Secs)" edc:when="(field &amp; 0x1f) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS10" edc:desc="1:2097152 (67.7 Secs)" edc:when="(field &amp; 0x1f) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSF" edc:desc="1:1048576 (33.825 Secs)" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSE" edc:desc="1:524288 (16.912 Secs)" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSD" edc:desc="1:262114 (8.456 Secs)" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSC" edc:desc="1:131072 (4.228 Secs)" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSB" edc:desc="1:65536 (2.114 Secs)" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSA" edc:desc="1:32768 (1.057 Secs)" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS9" edc:desc="1:16384 (528.5 mS)" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS8" edc:desc="1:8192 (264.3 mS)" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS7" edc:desc="1:4096 (132.1 mS)" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS6" edc:desc="1:2048 (66.1 mS)" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS5" edc:desc="1:1024 (33 mS)" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS4" edc:desc="1:512 (16.5 mS)" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS3" edc:desc="1: 256 (8.3 mS)" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS2" edc:desc="1:128 (4.1 mS)" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS1" edc:desc="1:64 (2.1 mS)" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS0" edc:desc="1:32 (1 mS)" edc:when="(field &amp; 0x1f) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTOSC" edc:desc="DSWDT Reference Clock Select" edc:mask="0x1" edc:name="DSWDTOSC" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="DSWDT uses LPRC as reference clock" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="DSWDT uses SOSC as reference clock" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSBOREN" edc:desc="Deep Sleep BOR Enable bit" edc:mask="0x1" edc:name="DSBOREN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="DSBOR Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="DSBOR Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTEN" edc:desc="Deep Sleep Watchdog Timer Enable" edc:mask="0x1" edc:name="DSWDTEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="DSWDT Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="DSWDT Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSSWEN" edc:desc="DSEN Bit Enable" edc:mask="0x1" edc:name="DSSWEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Deep Sleep is controlled by the register bit DSEN" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Deep Sleep operation is always disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES" edc:desc="Reserved" edc:ishidden="true" edc:mask="0x7f" edc:name="RES" edc:nzwidth="7">
              <edc:DCRFieldSemantic edc:cname="RES" edc:desc="Reserved" edc:when="(field &amp; 0x7f) == 0x7f"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
