balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA306.PIC
      <edc:DCRDef edc:access="-nnnnnnnnnnnnnnn" edc:cname="CONFIG1" edc:default="0x7fff" edc:desc="" edc:impl="0x7fff" edc:name="CONFIG1" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x7fff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WDTPS" edc:desc="Watchdog Timer Postscaler Select" edc:mask="0xf" edc:name="WDTPS" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:cname="PS32768" edc:desc="1:32,768" edc:when="(field &amp; 0xf) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="PS16384" edc:desc="1:16,384" edc:when="(field &amp; 0xf) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="PS8192" edc:desc="1:8,192" edc:when="(field &amp; 0xf) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="PS4096" edc:desc="1:4,096" edc:when="(field &amp; 0xf) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="PS2048" edc:desc="1:2,048" edc:when="(field &amp; 0xf) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="PS1024" edc:desc="1:1,024" edc:when="(field &amp; 0xf) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="PS512" edc:desc="1:512" edc:when="(field &amp; 0xf) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="PS256" edc:desc="1:256" edc:when="(field &amp; 0xf) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="PS128" edc:desc="1:128" edc:when="(field &amp; 0xf) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PS64" edc:desc="1:64" edc:when="(field &amp; 0xf) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PS32" edc:desc="1:32" edc:when="(field &amp; 0xf) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PS16" edc:desc="1:16" edc:when="(field &amp; 0xf) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PS8" edc:desc="1:8" edc:when="(field &amp; 0xf) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PS4" edc:desc="1:4" edc:when="(field &amp; 0xf) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PS2" edc:desc="1:2" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PS1" edc:desc="1:1" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWPSA" edc:desc="WDT Prescaler Ratio Select" edc:mask="0x1" edc:name="FWPSA" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="PR128" edc:desc="1:128" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PR32" edc:desc="1:32" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWDTEN" edc:desc="Watchdog Timer Enable" edc:mask="0x3" edc:name="FWDTEN" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="WDT_HW" edc:desc="WDT enabled in hardware" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WDT_SW" edc:desc="WDT controlled with the SWDTEN bit" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WDT_ACT" edc:desc="WDT enabled only while device active and disabled in Sleep" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WDT_DIS" edc:desc="WDT disabled in hardware; SWDTEN bit disabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WINDIS" edc:desc="Windowed WDT Disable" edc:mask="0x1" edc:name="WINDIS" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Standard Watchdog Timer" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Windowed Watchdog Timer" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ICS" edc:desc="Emulator Pin Placement Select bits" edc:mask="0x3" edc:name="ICS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="PGx3" edc:desc="Emulator functions are shared with PGEC3/PGED3" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PGx2" edc:desc="Emulator functions are shared with PGEC2/PGED2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PGx1" edc:desc="Emulator functions are shared with PGEC1/PGED1" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LPCFG" edc:desc="Low power regulator control" edc:mask="0x1" edc:name="LPCFG" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Low Power Regulator Control Enable" edc:ishidden="true" edc:mask="0x1" edc:name="DEBUG" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="GWRP" edc:desc="General Segment Write Protect" edc:mask="0x1" edc:name="GWRP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="GCP" edc:desc="General Segment Code Protect" edc:mask="0x1" edc:name="GCP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Code protection is disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Code protection is enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x80" edc:endaddr="0x2abf8"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="JTAGEN" edc:desc="JTAG Port Enable" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SIGN" edc:desc="Signature Bit" edc:ishidden="true" edc:mask="0x1" edc:name="SIGN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SIGN" edc:desc="Correct" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:WORMHoleSector>
    <edc:TestZone edc:appbeginaddr="0x800080" edc:appendaddr="0x8007c0" edc:beginaddr="0x800000" edc:endaddr="0x800800" edc:regionid="testmem"/>
    <edc:ConfigWORMSector edc:beginaddr="0xf80000" edc:endaddr="0xf80012" edc:regionid="cfgwormmem"/>
    <edc:DeviceIDSector edc:beginaddr="0xff0000" edc:endaddr="0xff0004" edc:mask="0xffff0000" edc:regionid="devid" edc:value="0x46C00000"/>
    <edc:BACKBUGVectorSector edc:beginaddr="0x800000" edc:endaddr="0x800008" edc:regionid="debug"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:xbeginaddr="0x800" edc:xendaddr="0x2800">
    <edc:RegardlessOfMode>
      <edc:EmulatorSector edc:beginaddr="0xFD0000" edc:endaddr="0xfd0046" edc:regionid="emulreg"/>
      <edc:GPRDataSector edc:beginaddr="0x800" edc:endaddr="0x2800" edc:regionid="data"/>
      <edc:SFRDataSector edc:beginaddr="0x0" edc:endaddr="0x0800" edc:regionid="sfrs">
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="WREG0" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="WREG0" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG0" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG0" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="WREG1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="WREG1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
