balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA306.PIC
        <edc:SFRDef edc:access="---------------n" edc:cname="CNPD3" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------0" edc:name="CNPD3" edc:nzwidth="0x10" edc:por="---------------0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN32PDE" edc:desc="" edc:mask="0x1" edc:name="CN32PDE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnn-" edc:cname="CNPD4" edc:desc="" edc:impl="0xfffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000000000-" edc:name="CNPD4" edc:nzwidth="0x10" edc:por="000000000000000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN49PDE" edc:desc="" edc:mask="0x1" edc:name="CN49PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN50PDE" edc:desc="" edc:mask="0x1" edc:name="CN50PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN51PDE" edc:desc="" edc:mask="0x1" edc:name="CN51PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN52PDE" edc:desc="" edc:mask="0x1" edc:name="CN52PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN53PDE" edc:desc="" edc:mask="0x1" edc:name="CN53PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN54PDE" edc:desc="" edc:mask="0x1" edc:name="CN54PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN55PDE" edc:desc="" edc:mask="0x1" edc:name="CN55PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN56PDE" edc:desc="" edc:mask="0x1" edc:name="CN56PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN57PDE" edc:desc="" edc:mask="0x1" edc:name="CN57PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN58PDE" edc:desc="" edc:mask="0x1" edc:name="CN58PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN59PDE" edc:desc="" edc:mask="0x1" edc:name="CN59PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN60PDE" edc:desc="" edc:mask="0x1" edc:name="CN60PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN61PDE" edc:desc="" edc:mask="0x1" edc:name="CN61PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN62PDE" edc:desc="" edc:mask="0x1" edc:name="CN62PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN63PDE" edc:desc="" edc:mask="0x1" edc:name="CN63PDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nnnnnn--nn" edc:cname="CNPD5" edc:desc="" edc:impl="0x3f3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------000000--00" edc:name="CNPD5" edc:nzwidth="0x10" edc:por="------000000--00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN64PDE" edc:desc="" edc:mask="0x1" edc:name="CN64PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN65PDE" edc:desc="" edc:mask="0x1" edc:name="CN65PDE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN68PDE" edc:desc="" edc:mask="0x1" edc:name="CN68PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN69PDE" edc:desc="" edc:mask="0x1" edc:name="CN69PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN70PDE" edc:desc="" edc:mask="0x1" edc:name="CN70PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN71PDE" edc:desc="" edc:mask="0x1" edc:name="CN71PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN72PDE" edc:desc="" edc:mask="0x1" edc:name="CN72PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN73PDE" edc:desc="" edc:mask="0x1" edc:name="CN73PDE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------n----" edc:cname="CNPD6" edc:desc="" edc:impl="0xfff0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------0----" edc:name="CNPD6" edc:nzwidth="0x10" edc:por="-----------0----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN84PDE" edc:desc="" edc:mask="0x1" edc:name="CN84PDE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnn--" edc:cname="CNEN1" edc:desc="" edc:impl="0xfffc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000--" edc:name="CNEN1" edc:nzwidth="0x10" edc:por="00000000000000--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN2IE" edc:desc="" edc:mask="0x1" edc:name="CN2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN3IE" edc:desc="" edc:mask="0x1" edc:name="CN3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN4IE" edc:desc="" edc:mask="0x1" edc:name="CN4IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN5IE" edc:desc="" edc:mask="0x1" edc:name="CN5IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN6IE" edc:desc="" edc:mask="0x1" edc:name="CN6IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN7IE" edc:desc="" edc:mask="0x1" edc:name="CN7IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN8IE" edc:desc="" edc:mask="0x1" edc:name="CN8IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN9IE" edc:desc="" edc:mask="0x1" edc:name="CN9IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN10IE" edc:desc="" edc:mask="0x1" edc:name="CN10IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN11IE" edc:desc="" edc:mask="0x1" edc:name="CN11IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN12IE" edc:desc="" edc:mask="0x1" edc:name="CN12IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN13IE" edc:desc="" edc:mask="0x1" edc:name="CN13IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN14IE" edc:desc="" edc:mask="0x1" edc:name="CN14IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN15IE" edc:desc="" edc:mask="0x1" edc:name="CN15IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
