balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA306.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnn--" edc:cname="CTMUCON2" edc:desc="" edc:impl="0xfffc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000--" edc:name="CTMUCON2" edc:nzwidth="16" edc:por="00000000000000--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="EDG2SEL" edc:desc="" edc:mask="0xf" edc:name="EDG2SEL" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="EDG2POL" edc:desc="" edc:mask="0x1" edc:name="EDG2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG2MOD" edc:desc="" edc:mask="0x1" edc:name="EDG2MOD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG1STAT" edc:desc="" edc:mask="0x1" edc:name="EDG1STAT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG2STAT" edc:desc="" edc:mask="0x1" edc:name="EDG2STAT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG1SEL" edc:desc="" edc:mask="0xf" edc:name="EDG1SEL" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="EDG1POL" edc:desc="" edc:mask="0x1" edc:name="EDG1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG1MOD" edc:desc="" edc:mask="0x1" edc:name="EDG1MOD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="EDG2SEL0" edc:desc="" edc:mask="0x1" edc:name="EDG2SEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG2SEL1" edc:desc="" edc:mask="0x1" edc:name="EDG2SEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG2SEL2" edc:desc="" edc:mask="0x1" edc:name="EDG2SEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG2SEL3" edc:desc="" edc:mask="0x1" edc:name="EDG2SEL3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="EDG1SEL0" edc:desc="" edc:mask="0x1" edc:name="EDG1SEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG1SEL1" edc:desc="" edc:mask="0x1" edc:name="EDG1SEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG1SEL2" edc:desc="" edc:mask="0x1" edc:name="EDG1SEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDG1SEL3" edc:desc="" edc:mask="0x1" edc:name="EDG1SEL3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn--------" edc:cname="CTMUICON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000--------" edc:name="CTMUICON" edc:nzwidth="16" edc:por="00000000--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="7"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IRNG" edc:desc="" edc:mask="0x3" edc:name="IRNG" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ITRIM" edc:desc="" edc:mask="0x3f" edc:name="ITRIM" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="IRNG0" edc:desc="" edc:mask="0x1" edc:name="IRNG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRNG1" edc:desc="" edc:mask="0x1" edc:name="IRNG1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ITRIM0" edc:desc="" edc:mask="0x1" edc:name="ITRIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ITRIM1" edc:desc="" edc:mask="0x1" edc:name="ITRIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ITRIM2" edc:desc="" edc:mask="0x1" edc:name="ITRIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ITRIM3" edc:desc="" edc:mask="0x1" edc:name="ITRIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ITRIM4" edc:desc="" edc:mask="0x1" edc:name="ITRIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ITRIM5" edc:desc="" edc:mask="0x1" edc:name="ITRIM5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="AD1CTMENH" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="AD1CTMENH" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CTMEN16" edc:desc="" edc:mask="0x1" edc:name="CTMEN16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN17" edc:desc="" edc:mask="0x1" edc:name="CTMEN17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN18" edc:desc="" edc:mask="0x1" edc:name="CTMEN18" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN19" edc:desc="" edc:mask="0x1" edc:name="CTMEN19" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN20" edc:desc="" edc:mask="0x1" edc:name="CTMEN20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN21" edc:desc="" edc:mask="0x1" edc:name="CTMEN21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN22" edc:desc="" edc:mask="0x1" edc:name="CTMEN22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN23" edc:desc="" edc:mask="0x1" edc:name="CTMEN23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN24" edc:desc="" edc:mask="0x1" edc:name="CTMEN24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN25" edc:desc="" edc:mask="0x1" edc:name="CTMEN25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN26" edc:desc="" edc:mask="0x1" edc:name="CTMEN26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN27" edc:desc="" edc:mask="0x1" edc:name="CTMEN27" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN28" edc:desc="" edc:mask="0x1" edc:name="CTMEN28" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN29" edc:desc="" edc:mask="0x1" edc:name="CTMEN29" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN30" edc:desc="" edc:mask="0x1" edc:name="CTMEN30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN31" edc:desc="" edc:mask="0x1" edc:name="CTMEN31" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="AD1CTMENL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="AD1CTMENL" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CTMEN0" edc:desc="" edc:mask="0x1" edc:name="CTMEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN1" edc:desc="" edc:mask="0x1" edc:name="CTMEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN2" edc:desc="" edc:mask="0x1" edc:name="CTMEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN3" edc:desc="" edc:mask="0x1" edc:name="CTMEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN4" edc:desc="" edc:mask="0x1" edc:name="CTMEN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN5" edc:desc="" edc:mask="0x1" edc:name="CTMEN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN6" edc:desc="" edc:mask="0x1" edc:name="CTMEN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN7" edc:desc="" edc:mask="0x1" edc:name="CTMEN7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN8" edc:desc="" edc:mask="0x1" edc:name="CTMEN8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN9" edc:desc="" edc:mask="0x1" edc:name="CTMEN9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN10" edc:desc="" edc:mask="0x1" edc:name="CTMEN10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN11" edc:desc="" edc:mask="0x1" edc:name="CTMEN11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN12" edc:desc="" edc:mask="0x1" edc:name="CTMEN12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN13" edc:desc="" edc:mask="0x1" edc:name="CTMEN13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN14" edc:desc="" edc:mask="0x1" edc:name="CTMEN14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMEN15" edc:desc="" edc:mask="0x1" edc:name="CTMEN15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
