balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA306.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA25" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA25" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S16C6" edc:desc="" edc:mask="0x1" edc:name="S16C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S17C6" edc:desc="" edc:mask="0x1" edc:name="S17C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S18C6" edc:desc="" edc:mask="0x1" edc:name="S18C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S19C6" edc:desc="" edc:mask="0x1" edc:name="S19C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S20C6" edc:desc="" edc:mask="0x1" edc:name="S20C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S21C6" edc:desc="" edc:mask="0x1" edc:name="S21C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S22C6" edc:desc="" edc:mask="0x1" edc:name="S22C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S23C6" edc:desc="" edc:mask="0x1" edc:name="S23C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S24C6" edc:desc="" edc:mask="0x1" edc:name="S24C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S25C6" edc:desc="" edc:mask="0x1" edc:name="S25C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S26C6" edc:desc="" edc:mask="0x1" edc:name="S26C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S27C6" edc:desc="" edc:mask="0x1" edc:name="S27C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S28C6" edc:desc="" edc:mask="0x1" edc:name="S28C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S29C6" edc:desc="" edc:mask="0x1" edc:name="S29C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S30C6" edc:desc="" edc:mask="0x1" edc:name="S30C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S31C6" edc:desc="" edc:mask="0x1" edc:name="S31C6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n---------------" edc:cname="LCDDATA26" edc:desc="" edc:impl="0x8000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u---------------" edc:name="LCDDATA26" edc:nzwidth="16" edc:por="0---------------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="S47C6" edc:desc="" edc:mask="0x1" edc:name="S47C6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------------n" edc:cname="LCDDATA27" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------u" edc:name="LCDDATA27" edc:nzwidth="16" edc:por="---------------0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S48C6" edc:desc="" edc:mask="0x1" edc:name="S48C6" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA28" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA28" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S00C7" edc:desc="" edc:mask="0x1" edc:name="S00C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S01C7" edc:desc="" edc:mask="0x1" edc:name="S01C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S02C7" edc:desc="" edc:mask="0x1" edc:name="S02C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S03C7" edc:desc="" edc:mask="0x1" edc:name="S03C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S04C7" edc:desc="" edc:mask="0x1" edc:name="S04C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S05C7" edc:desc="" edc:mask="0x1" edc:name="S05C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S06C7" edc:desc="" edc:mask="0x1" edc:name="S06C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S07C7" edc:desc="" edc:mask="0x1" edc:name="S07C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S08C7" edc:desc="" edc:mask="0x1" edc:name="S08C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S09C7" edc:desc="" edc:mask="0x1" edc:name="S09C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S10C7" edc:desc="" edc:mask="0x1" edc:name="S10C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S11C7" edc:desc="" edc:mask="0x1" edc:name="S11C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S12C7" edc:desc="" edc:mask="0x1" edc:name="S12C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S13C7" edc:desc="" edc:mask="0x1" edc:name="S13C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S14C7" edc:desc="" edc:mask="0x1" edc:name="S14C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S15C7" edc:desc="" edc:mask="0x1" edc:name="S15C7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA29" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA29" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S16C7" edc:desc="" edc:mask="0x1" edc:name="S16C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S17C7" edc:desc="" edc:mask="0x1" edc:name="S17C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S18C7" edc:desc="" edc:mask="0x1" edc:name="S18C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S19C7" edc:desc="" edc:mask="0x1" edc:name="S19C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S20C7" edc:desc="" edc:mask="0x1" edc:name="S20C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S21C7" edc:desc="" edc:mask="0x1" edc:name="S21C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S22C7" edc:desc="" edc:mask="0x1" edc:name="S22C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S23C7" edc:desc="" edc:mask="0x1" edc:name="S23C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S24C7" edc:desc="" edc:mask="0x1" edc:name="S24C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S25C7" edc:desc="" edc:mask="0x1" edc:name="S25C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S26C7" edc:desc="" edc:mask="0x1" edc:name="S26C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S27C7" edc:desc="" edc:mask="0x1" edc:name="S27C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S28C7" edc:desc="" edc:mask="0x1" edc:name="S28C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S29C7" edc:desc="" edc:mask="0x1" edc:name="S29C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S30C7" edc:desc="" edc:mask="0x1" edc:name="S30C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S31C7" edc:desc="" edc:mask="0x1" edc:name="S31C7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n---------------" edc:cname="LCDDATA30" edc:desc="" edc:impl="0x8000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u---------------" edc:name="LCDDATA30" edc:nzwidth="16" edc:por="0---------------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="S47C7" edc:desc="" edc:mask="0x1" edc:name="S47C7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
