balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA306.PIC
        <edc:SFRDef edc:access="nnnnn---nnnnnnnn" edc:cname="PMCS2MD" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000---00000000" edc:name="PMCS2MD" edc:nzwidth="16" edc:por="00000---00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DWAITE" edc:desc="" edc:mask="0x3" edc:name="DWAITE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DWAITM" edc:desc="" edc:mask="0xf" edc:name="DWAITM" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DWAITB" edc:desc="" edc:mask="0x3" edc:name="DWAITB" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="AMWAIT" edc:desc="" edc:mask="0x7" edc:name="AMWAIT" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="ACKM" edc:desc="" edc:mask="0x3" edc:name="ACKM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DWAITE0" edc:desc="" edc:mask="0x1" edc:name="DWAITE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITE1" edc:desc="" edc:mask="0x1" edc:name="DWAITE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITM0" edc:desc="" edc:mask="0x1" edc:name="DWAITM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITM1" edc:desc="" edc:mask="0x1" edc:name="DWAITM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITM2" edc:desc="" edc:mask="0x1" edc:name="DWAITM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITM3" edc:desc="" edc:mask="0x1" edc:name="DWAITM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITB0" edc:desc="" edc:mask="0x1" edc:name="DWAITB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DWAITB1" edc:desc="" edc:mask="0x1" edc:name="DWAITB1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="AMWAIT0" edc:desc="" edc:mask="0x1" edc:name="AMWAIT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AMWAIT1" edc:desc="" edc:mask="0x1" edc:name="AMWAIT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AMWAIT2" edc:desc="" edc:mask="0x1" edc:name="AMWAIT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKM0" edc:desc="" edc:mask="0x1" edc:name="ACKM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKM1" edc:desc="" edc:mask="0x1" edc:name="ACKM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PMDOUT1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="PMDOUT1" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMDOUT1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PMDOUT1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PMDOUT2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="PMDOUT2" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMDOUT2" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PMDOUT2" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PMDIN1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="PMDIN1" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMDIN1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PMDIN1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PMDIN2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="PMDIN2" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMDIN2" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PMDIN2" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rn--rrrrrn--rrrr" edc:cname="PMSTAT" edc:desc="" edc:impl="0xcfcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--000010--1111" edc:name="PMSTAT" edc:nzwidth="0x10" edc:por="00--000010--1111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OB0E" edc:desc="" edc:mask="0x1" edc:name="OB0E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OB1E" edc:desc="" edc:mask="0x1" edc:name="OB1E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OB2E" edc:desc="" edc:mask="0x1" edc:name="OB2E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OB3E" edc:desc="" edc:mask="0x1" edc:name="OB3E" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="OBUF" edc:desc="" edc:mask="0x1" edc:name="OBUF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OBE" edc:desc="" edc:mask="0x1" edc:name="OBE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IB0F" edc:desc="" edc:mask="0x1" edc:name="IB0F" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IB1F" edc:desc="" edc:mask="0x1" edc:name="IB1F" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IB2F" edc:desc="" edc:mask="0x1" edc:name="IB2F" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IB3F" edc:desc="" edc:mask="0x1" edc:name="IB3F" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IBOV" edc:desc="" edc:mask="0x1" edc:name="IBOV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IBF" edc:desc="" edc:mask="0x1" edc:name="IBF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ALRMVAL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ALRMVAL" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ALRMVAL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ALRMVAL" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
